Documents/ПокупкаКорма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПокупкаКорма</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СебестоимостьКотят</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коробка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Коробки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьКорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПокупкаКорма/Ext/ManagerModule.bsl
Процедура СоздатьПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПокупкаКорма.Ссылка КАК Ссылка ИЗ Документ.ПокупкаКорма КАК ПокупкаКорма";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	НовыйДокумент = Документы.ПокупкаКорма.СоздатьДокумент();
	НовыйДокумент.Дата = Дата('2025.03.14');
	НовыйДокумент.Коробка = Справочники.Коробки.НайтиПоНаименованию("1");
	НовыйДокумент.СтоимостьКорма = 75;	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	НовыйДокумент = Документы.ПокупкаКорма.СоздатьДокумент();
	НовыйДокумент.Дата = Дата('2025.03.14');
	НовыйДокумент.Коробка = Справочники.Коробки.НайтиПоНаименованию("2");
	НовыйДокумент.СтоимостьКорма = 30;	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
